diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	
	Если ДополнительныеСвойства <> Неопределено тогда
		
		Если ДополнительныеСвойства.Свойство("ЭтоНовый") тогда
			ТекстСообщения = СтрШаблон("Создан документ Обслуживание клиентов %1 от %2", 
			Номер, 
			Формат(Дата, "ДФ=dd.MM.yyyy;"));
		Иначе
			
			Если ДополнительныеСвойства.Количество() > 0 тогда
				ТекстСообщения = СтрШаблон("Изменен документ Обслуживание клиентов %1 от %2", 
				Номер, 
				Формат(Дата, "ДФ=dd.MM.yyyy;"));	
			КонецЕсли;
			
		КонецЕсли;
		
	 	Для каждого ЭлементСтруктуры из ДополнительныеСвойства цикл
	 		
	 		Если ЭлементСтруктуры.Ключ = "ЭтоНовый" тогда
	 			Продолжить;
	 		КонецЕсли;
	 		
	 		ТекстСообщения = СтрШаблон("%1%2%3: %4", 
	 		ТекстСообщения, 
	 		Символы.ПС, 
	 		ЭлементСтруктуры.Ключ, 
	 		ЭлементСтруктуры.Значение);
	 		
	 	КонецЦикла;
	
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстСообщения) тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		НовоеСообщениеБоту = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовоеСообщениеБоту.ТекстСообщения = ТекстСообщения;
		НовоеСообщениеБоту.Записать();
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора") <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание тогда
		
		ТекстСообщения = "Вид договора не соотвествует документу. Выберите договор с видом Абонентское обслуживание";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Договор", "Объект");
		Отказ = Истина;
			
	КонецЕсли;
	
	Если Дата < ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_ДатаНачалаДействияДоговора") тогда
			
		ТекстСообщения = "Дата документа не может быть раньше даты начала действия договора";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Дата", "Объект");
		Отказ = Истина;
			
	КонецЕсли;
		
	Если Дата > ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_ДатаОкончанияДействияДоговора") тогда
			
		ТекстСообщения = "Дата документа не может быть позже даты окончания действия договора";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Дата", "Объект");
		Отказ = Истина;
		
	КонецЕсли;
		
	ПроцентОплатыОтРаботы = ПолучитьПроцентОплатыСпециалиста();
	Если ПроцентОплатыОтРаботы = Неопределено тогда
		
		ТекстСообщения = СтрШаблон("Для сотрудника %1 не установлен процент оплаты", Специалист);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Специалист", "Объект");
		Отказ = Истина;
		
	КонецЕсли;	
		
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	СуммаПоДокументу = 0;	
	СформироватьДвиженияВКМ_ВыполненныеКлиентуРаботы(СуммаПоДокументу);
	СформироватьДвиженияВКМ_ВыполненныеСотрудникомРаботы(ПроцентОплатыОтРаботы, СуммаПоДокументу);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвиженияВКМ_ВыполненныеКлиентуРаботы(СуммаПоДокументу)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплатеКлиенту *
	|		ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка.Договор.ВКМ_СтоимостьЧаса) КАК СуммаКОплате,
	|	СУММА(ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК КоличествоЧасов,
	|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка.Клиент,
	|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка.Договор,
	|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка.Клиент,
	|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка.Договор,
	|	ВКМ_ОбслуживаниеКлиентовВыполненныеРаботы.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Пока Результат.Следующий() цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Результат);
		СуммаПоДокументу = СуммаПоДокументу + Результат.СуммаКОплате;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПроцентОплатыСпециалиста()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник = &Специалист) КАК
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ПроцентОтРабот;
	
КонецФункции

Процедура СформироватьДвиженияВКМ_ВыполненныеСотрудникомРаботы(ПроцентОплатыОтРаботы, СуммаПоДокументу)
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
	Движение.СуммаКОплате = СуммаПоДокументу* ПроцентОплатыОтРаботы/100;
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
